# GetSizes Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Segment..::..GetSizes Method
Segment Class See Also
---
Gets the defined sizes of the segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<MEPSize> GetSizes()
```

Visual Basic
---
```text
Public Function GetSizes As ICollection(Of MEPSize)
```

Visual C++
---
```text
public:
ICollection<MEPSize^>^ GetSizes()
```

# See Also
Segment Class
Autodesk.Revit.DB Namespace